<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/Barkoder.h</key>
		<data>
		9tBmdiEM3Piw6SdXbESop6X7Zac=
		</data>
		<key>Headers/iBarkoder.h</key>
		<data>
		zDPusR/tmMkflJ9D1enCFqAIWrw=
		</data>
		<key>Info.plist</key>
		<data>
		uPSy73NcTdbZrip0/EiRjP8DV4E=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		AR9UuWsitRjmz9jQFg/aWWzUbXM=
		</data>
		<key>default.metallib</key>
		<data>
		X4qTPqhy13Z4eIqBhoc/JR+M1Ys=
		</data>
		<key>mrz.traineddata</key>
		<data>
		LCB9HKlImEGzlmLulZhNhPNS9fs=
		</data>
		<key>mrzfast.traineddata</key>
		<data>
		Tqv+KEU48QJIZYwt6e2zoMhFoWw=
		</data>
		<key>n2_384x256_int8.mlmodelc/analytics/coremldata.bin</key>
		<data>
		K0ekHWwHVntSh8mx5w47kwF1dkA=
		</data>
		<key>n2_384x256_int8.mlmodelc/coremldata.bin</key>
		<data>
		kq92NtZsFzPhsaIjQ/tCswPi/vU=
		</data>
		<key>n2_384x256_int8.mlmodelc/metadata.json</key>
		<data>
		N4ghTMFxj1A69TxIWQMzw4vFfyI=
		</data>
		<key>n2_384x256_int8.mlmodelc/model.espresso.net</key>
		<data>
		kcVyWLevdtaUsdwRMNl/3hIPZMU=
		</data>
		<key>n2_384x256_int8.mlmodelc/model.espresso.shape</key>
		<data>
		YesdSRhvqOaJEiaHrLMuGbuidFg=
		</data>
		<key>n2_384x256_int8.mlmodelc/model.espresso.weights</key>
		<data>
		7d5nHbY1MzepbigLLdfkpJdEylU=
		</data>
		<key>n2_384x256_int8.mlmodelc/model/coremldata.bin</key>
		<data>
		tGU7K8v0jbmLrWPOZkDsl7EBsZk=
		</data>
		<key>n2_384x256_int8.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>n2_512x384_int8.mlmodelc/analytics/coremldata.bin</key>
		<data>
		lduSEjWhw1hYKZfeuBIuZGaPs/g=
		</data>
		<key>n2_512x384_int8.mlmodelc/coremldata.bin</key>
		<data>
		pRy3e1gkbR2BNRAFdNazgUblptk=
		</data>
		<key>n2_512x384_int8.mlmodelc/metadata.json</key>
		<data>
		vN4nOF6vcH8HxVeeSkrXCQfLQcs=
		</data>
		<key>n2_512x384_int8.mlmodelc/model.espresso.net</key>
		<data>
		xMoGREC/nJPono4zK65JevpXfjQ=
		</data>
		<key>n2_512x384_int8.mlmodelc/model.espresso.shape</key>
		<data>
		HMrUSp1GqaiC4PWqROM4uK3c+yM=
		</data>
		<key>n2_512x384_int8.mlmodelc/model.espresso.weights</key>
		<data>
		7d5nHbY1MzepbigLLdfkpJdEylU=
		</data>
		<key>n2_512x384_int8.mlmodelc/model/coremldata.bin</key>
		<data>
		tGU7K8v0jbmLrWPOZkDsl7EBsZk=
		</data>
		<key>n2_512x384_int8.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/Barkoder.h</key>
		<dict>
			<key>hash2</key>
			<data>
			GlwDlR4ZXGSuIEGAj0VwxucXuB4qtUkoo9HAgLSbQ3k=
			</data>
		</dict>
		<key>Headers/iBarkoder.h</key>
		<dict>
			<key>hash2</key>
			<data>
			QiNckUrAjEtbEVUPkZjkmjaobwbR8xAvoJlb2uas1bQ=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			hAN9dH0zjUR8kFnFBQlkaxw2Rekc7mlT4bgs+bLY2tc=
			</data>
		</dict>
		<key>default.metallib</key>
		<dict>
			<key>hash2</key>
			<data>
			8ADKtFoCK6dn4QQ2cNaIvF/O4vqNQ9OsogmNQqeHW8M=
			</data>
		</dict>
		<key>mrz.traineddata</key>
		<dict>
			<key>hash2</key>
			<data>
			f2wpUj+pNsfvU9JZZIPiG4LVBjfz8ebGf31P6lkOJS0=
			</data>
		</dict>
		<key>mrzfast.traineddata</key>
		<dict>
			<key>hash2</key>
			<data>
			7OKlTxJac3kvnOx05vjmL25eAMfxkVO6hlr2ib5bXwE=
			</data>
		</dict>
		<key>n2_384x256_int8.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			fPEoQpohBvjhvbgEDHdq8Zwc9PzsQ+ANS5BOJOsUNus=
			</data>
		</dict>
		<key>n2_384x256_int8.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			dUreVCngceMSGTfYkXUkic0SVkUbp2hyJH7gZfKWQTo=
			</data>
		</dict>
		<key>n2_384x256_int8.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			eq5p1cX/NWprT0GE3ooO/3OgYTi4V20JV6QfwT0rfkM=
			</data>
		</dict>
		<key>n2_384x256_int8.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			HYUg4mQw05AVYfU4tTvprY2OZaPaZPg1pi9Rogjz8VA=
			</data>
		</dict>
		<key>n2_384x256_int8.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			GnNo/duLPF8AO2QdgOi4JZk9x0RI6DvnPTQHJckcMn0=
			</data>
		</dict>
		<key>n2_384x256_int8.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			YeomzgiWLuV5IuuvYlyZ+Ovl9HSw6MwNhcIzu+2GmNg=
			</data>
		</dict>
		<key>n2_384x256_int8.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			JsMfzXP3J1PCXEF2nqub8rHW9vXpXkr2ag9c2kxRcE8=
			</data>
		</dict>
		<key>n2_384x256_int8.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>n2_512x384_int8.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			TH98apmWsP+5bn9lfPBXLRiY6fgmJzDSVxsGRqvpx6o=
			</data>
		</dict>
		<key>n2_512x384_int8.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			FuOVhipIFJGh1uXZVJ2k1r+NxlldEZuXUQx/zi2o3D0=
			</data>
		</dict>
		<key>n2_512x384_int8.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			ZNG3uSwLTw92yu+rEVNPtvhvKJG8ogAEILbJoZeLJoE=
			</data>
		</dict>
		<key>n2_512x384_int8.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			gOCZszPcUirPqzNU4dSi6IUaWafZr2Biio3R+YhsSfo=
			</data>
		</dict>
		<key>n2_512x384_int8.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			0qOgbw0u1Q94ZbVIWGdsmU1h/rHxVhuTwP9zbMXFR2A=
			</data>
		</dict>
		<key>n2_512x384_int8.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			YeomzgiWLuV5IuuvYlyZ+Ovl9HSw6MwNhcIzu+2GmNg=
			</data>
		</dict>
		<key>n2_512x384_int8.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			JsMfzXP3J1PCXEF2nqub8rHW9vXpXkr2ag9c2kxRcE8=
			</data>
		</dict>
		<key>n2_512x384_int8.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
