<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Headers/Barkoder.h</key>
		<data>
		9tBmdiEM3Piw6SdXbESop6X7Zac=
		</data>
		<key>Headers/iBarkoder.h</key>
		<data>
		TvkdRX4OH7h6js7os0IJImihRoM=
		</data>
		<key>Info.plist</key>
		<data>
		SEufaPMhj97lzfvTwUJZegReZcE=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		AR9UuWsitRjmz9jQFg/aWWzUbXM=
		</data>
		<key>default.metallib</key>
		<data>
		1kVi10jUTLTwVVLPVu69SUzh3kc=
		</data>
		<key>float16_512x384.mlmodelc/analytics/coremldata.bin</key>
		<data>
		Oq5qNbZ/t6sCDjw4+Ry0u+cv+sQ=
		</data>
		<key>float16_512x384.mlmodelc/coremldata.bin</key>
		<data>
		OccxkIgBDUmh3UHLfHhZYi8BFSQ=
		</data>
		<key>float16_512x384.mlmodelc/metadata.json</key>
		<data>
		YNLJi2S+xSXe89S6CHdWEAkYmnk=
		</data>
		<key>float16_512x384.mlmodelc/model.mil</key>
		<data>
		OEOsMWTFyLixwOlzQ6C82xPWeoA=
		</data>
		<key>float16_512x384.mlmodelc/weights/weight.bin</key>
		<data>
		neoblnL3W+LGlE3ys5ujeYlwb9E=
		</data>
		<key>int8_384x256_small2.mlmodelc/analytics/coremldata.bin</key>
		<data>
		7piZVfaNpKxEZhDzdRTUaXXsQ8I=
		</data>
		<key>int8_384x256_small2.mlmodelc/coremldata.bin</key>
		<data>
		nsHTr+ofyx5psOMprF9OMcXxsSg=
		</data>
		<key>int8_384x256_small2.mlmodelc/metadata.json</key>
		<data>
		4dCmLCEEqfUuGBSSrBMhh9x0Iq4=
		</data>
		<key>int8_384x256_small2.mlmodelc/model.espresso.net</key>
		<data>
		kpoTEHpblsrvkAFg8ftDtj63T0o=
		</data>
		<key>int8_384x256_small2.mlmodelc/model.espresso.shape</key>
		<data>
		OcwFv4hcF6eLrbmxbxIM+dbeVkY=
		</data>
		<key>int8_384x256_small2.mlmodelc/model.espresso.weights</key>
		<data>
		taLYUmNcIg8xgnLel+6Mlvrpw/w=
		</data>
		<key>int8_384x256_small2.mlmodelc/model/coremldata.bin</key>
		<data>
		tGU7K8v0jbmLrWPOZkDsl7EBsZk=
		</data>
		<key>int8_384x256_small2.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>mrz.traineddata</key>
		<data>
		LCB9HKlImEGzlmLulZhNhPNS9fs=
		</data>
		<key>mrzfast.traineddata</key>
		<data>
		Tqv+KEU48QJIZYwt6e2zoMhFoWw=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/Barkoder.h</key>
		<dict>
			<key>hash2</key>
			<data>
			GlwDlR4ZXGSuIEGAj0VwxucXuB4qtUkoo9HAgLSbQ3k=
			</data>
		</dict>
		<key>Headers/iBarkoder.h</key>
		<dict>
			<key>hash2</key>
			<data>
			QBkCB//Rvx7WOxbngySORAWhwjWZM9P6bOWTkqlkENk=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			hAN9dH0zjUR8kFnFBQlkaxw2Rekc7mlT4bgs+bLY2tc=
			</data>
		</dict>
		<key>default.metallib</key>
		<dict>
			<key>hash2</key>
			<data>
			vrm2byECR/2l/q6buzQp1ljYDpG/0uVE8wgD7aCl7A0=
			</data>
		</dict>
		<key>float16_512x384.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			h29n3Eoics/TrOWunfvZpf8fZ7jOlE0H0Z8VzMEv9kQ=
			</data>
		</dict>
		<key>float16_512x384.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			giPgsKBaQSe3WX4pED5vxW31UBDp+B/B3cP81JlEZPM=
			</data>
		</dict>
		<key>float16_512x384.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			4nygWe9rtm7Dl422MGI38u4PGd8fx4rz/SOo/E+D0fI=
			</data>
		</dict>
		<key>float16_512x384.mlmodelc/model.mil</key>
		<dict>
			<key>hash2</key>
			<data>
			viqOKgJl561maLlEUdGZx83Phc8Xf60R2noufvkhq64=
			</data>
		</dict>
		<key>float16_512x384.mlmodelc/weights/weight.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			F1Rxfa9na6oCDWfo2+tILD6ZPUX0dvi1iBdeM10fzRM=
			</data>
		</dict>
		<key>int8_384x256_small2.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			S1c++xvQjePu/DLCBXpM+hCYiuvS6JPgm6m3OBd58ZY=
			</data>
		</dict>
		<key>int8_384x256_small2.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			f3b2FfEpQGCxWmXP5ptb/0v1E44dnPxeA2+WZLjc+HU=
			</data>
		</dict>
		<key>int8_384x256_small2.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			hyOkS/OFXHuyd6qdoW6HSSDVS3oo/PNhpwa5lZ1r+YU=
			</data>
		</dict>
		<key>int8_384x256_small2.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Ts3llMeEgZL/ogVAVDy4zNHj+naO3LJ7YSiVlaKrmeU=
			</data>
		</dict>
		<key>int8_384x256_small2.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			Bz9kx60E0gpoeaZ0kOyZNbr3zB4Gly5UFnB6oAQbWu8=
			</data>
		</dict>
		<key>int8_384x256_small2.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			sr9DmEY64lvzNjHTHCDzQ9bN5YoPaXNTfxnPfUzwqeg=
			</data>
		</dict>
		<key>int8_384x256_small2.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			JsMfzXP3J1PCXEF2nqub8rHW9vXpXkr2ag9c2kxRcE8=
			</data>
		</dict>
		<key>int8_384x256_small2.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>mrz.traineddata</key>
		<dict>
			<key>hash2</key>
			<data>
			f2wpUj+pNsfvU9JZZIPiG4LVBjfz8ebGf31P6lkOJS0=
			</data>
		</dict>
		<key>mrzfast.traineddata</key>
		<dict>
			<key>hash2</key>
			<data>
			7OKlTxJac3kvnOx05vjmL25eAMfxkVO6hlr2ib5bXwE=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
